** Two Router and One Switch ** 


1-Config router to start up

>> Switch>en  : Enable mode 

>> Switch#conf t	: config global mode 

>> Switch#conf terminal 

Enter configuration commands, one per line.  End with CNTL/Z.

Switch(config)# 

2- interface checking 


Router(config)#interface 
% Incomplete command.
Router(config)#interface ?
  Dialer            Dialer interface
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Port-channel      Ethernet Channel of interfaces
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  range             interface range command

Router(config)#interface 


Note we use ? ==> to show all the interface mode in the router 


3- Chose interface you want to config 

>> Router(config)#interface gigabitEthernet 0/0/0
>> Router(config-if)#

or 

To show the ip interfae :

>> show ip int brief 


Router>show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down


------------------------------------------------------------

Step 3 short cut : after we know the port : GigabitEthernet0/0/0 (this is what we connection to the Swtich)

>> 
Router(config)#int g0/0/0
Router(config-if)#


4- setup ip address and subnetmask 

Router(config-if)#ip address ?
  A.B.C.D  IP address
  dhcp     IP Address negotiated via DHCP


==> 

>> Router(config-if)#ip address 10.1.1.1 255.255.255.0

5- start the router 

by default the router will shout down ==> so we need to make it working 

>> Router(config-if)#no shutdown 


%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up


6 - Assign name to the Router when it start 

Router(config-if)#exit
Router(config)#host
Router(config)#hostname R1

==> R1#

R1#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]


----------------------------------------------------


7 - To Save Configuration :

R1#copy run
R1#copy running-config st
R1#copy running-config startup-config 
Destination filename [startup-config]? 
















































































































































































